# BANKING LOAN APPROVAL PREDICTOR

# IMPORTING REQUIRED LIBRARIES

In [2]:
import pandas as pd
import seaborn as sns
import numpy as np
import warnings
warnings.filterwarnings('ignore')

#LOADING THE DATA
df=pd.read_csv("/home/expert/Jupyter Notebook/Loan_approval_Predictor/Loan_dataset.csv")
df.head()

,Unnamed: 0,Loan_ID,Gender,Married,Dependents,Education,Self_Employed,ApplicantIncome,CoapplicantIncome,LoanAmount,Loan_Amount_Term,Credit_History,Property_Area,sourcefilename,Loan_Status
0,0,LP001015,Male,Yes,0,Graduate,No,5720,0.0,110.0,360.0,1.0,Urban,/home/expert/Jupyter Notebook/Loan_approval_Pr...,NaN
1,1,LP001022,Male,Yes,1,Graduate,No,3076,1500.0,126.0,360.0,1.0,Urban,/home/expert/Jupyter Notebook/Loan_approval_Pr...,NaN
2,2,LP001031,Male,Yes,2,Graduate,No,5000,1800.0,208.0,360.0,1.0,Urban,/home/expert/Jupyter Notebook/Loan_approval_Pr...,NaN
3,3,LP001035,Male,Yes,2,Graduate,No,2340,2546.0,100.0,360.0,NaN,Urban,/home/expert/Jupyter Notebook/Loan_approval_Pr...,NaN
4,4,LP001051,Male,No,0,Not Graduate,No,3276,0.0,78.0,360.0,1.0,Urban,/home/expert/Jupyter Notebook/Loan_approval_Pr...,NaN

In [3]:
# Last 5 Rows
df.tail()

,Unnamed: 0,Loan_ID,Gender,Married,Dependents,Education,Self_Employed,ApplicantIncome,CoapplicantIncome,LoanAmount,Loan_Amount_Term,Credit_History,Property_Area,sourcefilename,Loan_Status
1343,362,LP002971,Male,Yes,3+,Not Graduate,Yes,4009,1777.0,113.0,360.0,1.0,Urban,/home/expert/Jupyter Notebook/Loan_approval_Pr...,NaN
1344,363,LP002975,Male,Yes,0,Graduate,No,4158,709.0,115.0,360.0,1.0,Urban,/home/expert/Jupyter Notebook/Loan_approval_Pr...,NaN
1345,364,LP002980,Male,No,0,Graduate,No,3250,1993.0,126.0,360.0,NaN,Semiurban,/home/expert/Jupyter Notebook/Loan_approval_Pr...,NaN
1346,365,LP002986,Male,Yes,0,Graduate,No,5000,2393.0,158.0,360.0,1.0,Rural,/home/expert/Jupyter Notebook/Loan_approval_Pr...,NaN
1347,366,LP002989,Male,No,0,Graduate,Yes,9200,0.0,98.0,180.0,1.0,Rural,/home/expert/Jupyter Notebook/Loan_approval_Pr...,NaN

# DATA PREPROCESSING

In [4]:
#Total Rows and Columns
df.shape

(1348, 15)

In [5]:
#TOTAL INFO
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1348 entries, 0 to 1347
Data columns (total 15 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   Unnamed: 0         1348 non-null   int64
 1   Loan_ID            1348 non-null   object
 2   Gender             1313 non-null   object
 3   Married            1345 non-null   object
 4   Dependents         1313 non-null   object
 5   Education          1348 non-null   object
 6   Self_Employed      1270 non-null   object
 7   ApplicantIncome    1348 non-null   int64
 8   CoapplicantIncome  1348 non-null   float64
 9   LoanAmount         1316 non-null   float64
 10  Loan_Amount_Term   1322 non-null   float64
 11  Credit_History     1240 non-null   float64
 12  Property_Area      1348 non-null   object
 13  sourcefilename     1348 non-null   object
 14  Loan_Status        614 non-null    object
dtypes: float64(4), int64(2), object(9)
memory usage: 158.1+ KB

In [6]:
#Columns to List
df.columns.tolist()

['Unnamed: 0',
 'Loan_ID',
 'Gender',
 'Married',
 'Dependents',
 'Education',
 'Self_Employed',
 'ApplicantIncome',
 'CoapplicantIncome',
 'LoanAmount',
 'Loan_Amount_Term',
 'Credit_History',
 'Property_Area',
 'sourcefilename',
 'Loan_Status']

In [7]:
#CHECKING WHEATHER NULL VALUES ARE PRESENT OR NOT
df.isnull().any(axis=0)

Unnamed: 0           False
Loan_ID              False
Gender                True
Married               True
Dependents            True
Education            False
Self_Employed         True
ApplicantIncome      False
CoapplicantIncome    False
LoanAmount            True
Loan_Amount_Term      True
Credit_History        True
Property_Area        False
sourcefilename       False
Loan_Status           True
dtype: bool

In [8]:
#CHECKING SUM OF 
df.isnull().sum()

Unnamed: 0             0
Loan_ID                0
Gender                35
Married                3
Dependents            35
Education              0
Self_Employed         78
ApplicantIncome        0
CoapplicantIncome      0
LoanAmount            32
Loan_Amount_Term      26
Credit_History       108
Property_Area          0
sourcefilename         0
Loan_Status          734
dtype: int64

In [9]:
#DROPPED THE COLUMN Unnamed: 0 , sourcefilename
df=df.drop(['Unnamed: 0','sourcefilename'],axis=1)

In [10]:
df.head()

,Loan_ID,Gender,Married,Dependents,Education,Self_Employed,ApplicantIncome,CoapplicantIncome,LoanAmount,Loan_Amount_Term,Credit_History,Property_Area,Loan_Status
0,LP001015,Male,Yes,0,Graduate,No,5720,0.0,110.0,360.0,1.0,Urban,NaN
1,LP001022,Male,Yes,1,Graduate,No,3076,1500.0,126.0,360.0,1.0,Urban,NaN
2,LP001031,Male,Yes,2,Graduate,No,5000,1800.0,208.0,360.0,1.0,Urban,NaN
3,LP001035,Male,Yes,2,Graduate,No,2340,2546.0,100.0,360.0,NaN,Urban,NaN
4,LP001051,Male,No,0,Not Graduate,No,3276,0.0,78.0,360.0,1.0,Urban,NaN

In [11]:
#GENDER COLUMN
df["Gender"].unique()

array(['Male', 'Female', nan], dtype=object)

In [12]:
#CHECKING THE UNIQUE VALUE COUNT IN GENDER COLUMN
df["Gender"].value_counts()

Male      1061
Female     252
Name: Gender, dtype: int64

In [13]:
#MARRIED COLUMN
df["Married"].unique()

array(['Yes', 'No', nan], dtype=object)

In [14]:
#UNIQUE VALUES COUNT IN MARRIED COLUMN
df["Married"].value_counts()

Yes    864
No     481
Name: Married, dtype: int64

In [15]:
#DEPENDENTS COLUMN
df["Dependents"].unique()

array(['0', '1', '2', '3+', nan], dtype=object)

In [16]:
#UNIQUE VALUES IN DEPENDENTS COLUMN
df["Dependents"].value_counts()

0     745
2     219
1     218
3+    131
Name: Dependents, dtype: int64

In [17]:
#EDUCATION COLUMN
df["Education"].unique()

array(['Graduate', 'Not Graduate'], dtype=object)

In [18]:
#UNIQUE VALUE COUNTS IN EDUCATION COLUMN
df["Education"].value_counts()

Graduate        1046
Not Graduate     302
Name: Education, dtype: int64

In [19]:
#SELF EMPLOYED COLUMN
df["Self_Employed"].unique()

array(['No', 'Yes', nan], dtype=object)

In [20]:
#SELF EMPLOYED UNIQUE VALUE COUNTS
df["Self_Employed"].value_counts()

No     1114
Yes     156
Name: Self_Employed, dtype: int64

In [21]:
#APPLICANT INCOME UNIQUE VALUE COUNT
df["ApplicantIncome"].count()

1348

In [22]:
#APPLICANT INCOME
df["ApplicantIncome"]

0       5720
1       3076
2       5000
3       2340
4       3276
        ...
1343    4009
1344    4158
1345    3250
1346    5000
1347    9200
Name: ApplicantIncome, Length: 1348, dtype: int64

In [23]:
#CoapplicantIncome Column
df["CoapplicantIncome"]

0          0.0
1       1500.0
2       1800.0
3       2546.0
4          0.0
         ...
1343    1777.0
1344     709.0
1345    1993.0
1346    2393.0
1347       0.0
Name: CoapplicantIncome, Length: 1348, dtype: float64

In [24]:
#COAPPLICANTINCOME COUNT
df["CoapplicantIncome"].count()

1348

In [25]:
#LOAN AMOUNT TERM UNIQUE VALUES
df["Loan_Amount_Term"].unique()

array([360., 240., 180.,  nan,  60., 480.,  84.,  12., 300., 350.,  36.,
       120.,   6.])

In [26]:
#LOAN AMOUNT TERM VALUE COUNTS
df["Loan_Amount_Term"].value_counts()

360.0    1134
180.0      88
480.0      31
300.0      27
240.0      12
84.0       10
120.0       5
60.0        4
36.0        4
12.0        3
350.0       2
6.0         2
Name: Loan_Amount_Term, dtype: int64

In [27]:
#PROPERTY AREA UNIQUE ITEMS
df["Property_Area"].unique()

array(['Urban', 'Semiurban', 'Rural'], dtype=object)

In [28]:
#PROPERTY AREA UNIQUUE ITEMS VALUE COUNTS
df["Property_Area"].value_counts()

Urban        482
Semiurban    465
Rural        401
Name: Property_Area, dtype: int64

In [29]:
#CREDIT HISTORY UNIQUE VALUES
df["Credit_History"].unique()

array([ 1., nan,  0.])

In [30]:
#CREDIT HISTORY COLUMN UNIQUE VALUE COUNT
df["Credit_History"].value_counts()

1.0    1033
0.0     207
Name: Credit_History, dtype: int64

In [31]:
#INFO OF EACH COLUMNS
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1348 entries, 0 to 1347
Data columns (total 13 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   Loan_ID            1348 non-null   object
 1   Gender             1313 non-null   object
 2   Married            1345 non-null   object
 3   Dependents         1313 non-null   object
 4   Education          1348 non-null   object
 5   Self_Employed      1270 non-null   object
 6   ApplicantIncome    1348 non-null   int64
 7   CoapplicantIncome  1348 non-null   float64
 8   LoanAmount         1316 non-null   float64
 9   Loan_Amount_Term   1322 non-null   float64
 10  Credit_History     1240 non-null   float64
 11  Property_Area      1348 non-null   object
 12  Loan_Status        614 non-null    object
dtypes: float64(4), int64(1), object(8)
memory usage: 137.0+ KB

In [32]:
# Statistical info
df.describe()

,ApplicantIncome,CoapplicantIncome,LoanAmount,Loan_Amount_Term,Credit_History
count,1348.000000,1348.000000,1316.000000,1322.000000,1240.000000
mean,5077.918398,1593.111958,140.756839,342.293495,0.833065
std,5493.395982,2618.869966,73.389208,65.091411,0.373069
min,0.000000,0.000000,9.000000,6.000000,0.000000
25%,2871.750000,0.000000,100.000000,360.000000,1.000000
50%,3791.000000,1084.500000,126.000000,360.000000,1.000000
75%,5385.750000,2382.250000,160.000000,360.000000,1.000000
max,81000.000000,41667.000000,700.000000,480.000000,1.000000

In [33]:
df.isnull().sum()

Loan_ID                0
Gender                35
Married                3
Dependents            35
Education              0
Self_Employed         78
ApplicantIncome        0
CoapplicantIncome      0
LoanAmount            32
Loan_Amount_Term      26
Credit_History       108
Property_Area          0
Loan_Status          734
dtype: int64

In [34]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1348 entries, 0 to 1347
Data columns (total 13 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   Loan_ID            1348 non-null   object
 1   Gender             1313 non-null   object
 2   Married            1345 non-null   object
 3   Dependents         1313 non-null   object
 4   Education          1348 non-null   object
 5   Self_Employed      1270 non-null   object
 6   ApplicantIncome    1348 non-null   int64
 7   CoapplicantIncome  1348 non-null   float64
 8   LoanAmount         1316 non-null   float64
 9   Loan_Amount_Term   1322 non-null   float64
 10  Credit_History     1240 non-null   float64
 11  Property_Area      1348 non-null   object
 12  Loan_Status        614 non-null    object
dtypes: float64(4), int64(1), object(8)
memory usage: 137.0+ KB

# NULL VALUES PRESENT IN CATEGORICAL COLUMN

In [35]:
#Categorical Column--> Gender,Married,Dependents,Education,Self_Employed,Property_Area   
#Categorical Column with Null Values (Gender,Married,Dependents,Self_Employed)
df[['Gender','Married','Dependents','Self_Employed']]

     Gender Married Dependents Self_Employed
0      Male     Yes          0            No
1      Male     Yes          1            No
2      Male     Yes          2            No
3      Male     Yes          2            No
4      Male      No          0            No
...     ...     ...        ...           ...
1343   Male     Yes         3+           Yes
1344   Male     Yes          0            No
1345   Male      No          0            No
1346   Male     Yes          0            No
1347   Male      No          0           Yes

[1348 rows x 4 columns]

In [36]:
df.isnull().sum()

Loan_ID                0
Gender                35
Married                3
Dependents            35
Education              0
Self_Employed         78
ApplicantIncome        0
CoapplicantIncome      0
LoanAmount            32
Loan_Amount_Term      26
Credit_History       108
Property_Area          0
Loan_Status          734
dtype: int64

# NULL VALUES PRESENT IN NUMERICAL COLUMNS

In [37]:
#Numerical Column--> With Null Values (LoanAmount,Loan_Amount_Term,Credit_History)
df[['LoanAmount','Loan_Amount_Term','Credit_History']]

      LoanAmount  Loan_Amount_Term  Credit_History
0          110.0             360.0             1.0
1          126.0             360.0             1.0
2          208.0             360.0             1.0
3          100.0             360.0             NaN
4           78.0             360.0             1.0
...          ...               ...             ...
1343       113.0             360.0             1.0
1344       115.0             360.0             1.0
1345       126.0             360.0             NaN
1346       158.0             360.0             1.0
1347        98.0             180.0             1.0

[1348 rows x 3 columns]

In [38]:
df['Loan_ID'].shape

(1348,)

In [39]:
#DROPPED Loan_ID COLUMN
df=df.drop(['Loan_ID'],axis=1)
df.head()

,Gender,Married,Dependents,Education,Self_Employed,ApplicantIncome,CoapplicantIncome,LoanAmount,Loan_Amount_Term,Credit_History,Property_Area,Loan_Status
0,Male,Yes,0,Graduate,No,5720,0.0,110.0,360.0,1.0,Urban,NaN
1,Male,Yes,1,Graduate,No,3076,1500.0,126.0,360.0,1.0,Urban,NaN
2,Male,Yes,2,Graduate,No,5000,1800.0,208.0,360.0,1.0,Urban,NaN
3,Male,Yes,2,Graduate,No,2340,2546.0,100.0,360.0,NaN,Urban,NaN
4,Male,No,0,Not Graduate,No,3276,0.0,78.0,360.0,1.0,Urban,NaN

In [40]:
df.shape

(1348, 12)

# LABEL ENCODING - DEALING WITH CATEGORICAL COLUMNS

In [41]:
#1.Loan_Status Column
df['Loan_Status'].unique()

array([nan, 'Y', 'N'], dtype=object)

In [42]:
#LABEL ENCODING ON Loan_Status
df.Loan_Status=df.Loan_Status.map({'Y':1,'N':0})

In [43]:
df['Loan_Status'].value_counts()

1.0    422
0.0    192
Name: Loan_Status, dtype: int64

In [44]:
#2.Married Column
df['Married'].value_counts()

Yes    864
No     481
Name: Married, dtype: int64

In [45]:
#LABEL ENCODING ON MARRIED COLUMN
df.Married=df.Married.map({'Yes':1,'No':0})

In [46]:
df['Married'].value_counts()

1.0    864
0.0    481
Name: Married, dtype: int64

In [47]:
#3.Dependents Column
df['Dependents'].unique()

array(['0', '1', '2', '3+', nan], dtype=object)

In [48]:
#LABEL ENCODING ON DEPENDENTS
df.Dependents=df.Dependents.map({'0':0,'1':1,'2':2,'3+':3})

In [49]:
df['Dependents'].value_counts()

0.0    745
2.0    219
1.0    218
3.0    131
Name: Dependents, dtype: int64

In [50]:
#4.Self_Employed Column
df['Self_Employed'].unique()

array(['No', 'Yes', nan], dtype=object)

In [51]:
#LABEL ENCODING ON Self_Employed
df.Self_Employed=df.Self_Employed.map({'Yes':1,'No':0})

In [52]:
df['Self_Employed'].value_counts()

0.0    1114
1.0     156
Name: Self_Employed, dtype: int64

In [53]:
#5.Education Column
df['Education'].value_counts()

Graduate        1046
Not Graduate     302
Name: Education, dtype: int64

In [54]:
#LABEL ENCODING ON Education
df.Education=df.Education.map({'Graduate':1,'Not Graduate':0})

In [55]:
df['Education'].value_counts()

1    1046
0     302
Name: Education, dtype: int64

In [56]:
#6.Gender Column
df['Gender'].value_counts()

Male      1061
Female     252
Name: Gender, dtype: int64

In [57]:
#LABEL ENCODING ON Gender
df.Gender=df.Gender.map({'Male':1,'Female':0})

In [58]:
#6.Property_Area Column
df['Property_Area'].value_counts()

Urban        482
Semiurban    465
Rural        401
Name: Property_Area, dtype: int64

In [59]:
#LABEL ENCODING ON Property_Area
df.Property_Area=df.Property_Area.map({'Urban':2,'Rural':0,'Semiurban':1})

In [60]:
# 6.Property_Area Column
df['Property_Area'].value_counts()

2    482
1    465
0    401
Name: Property_Area, dtype: int64

In [61]:
df.head()

,Gender,Married,Dependents,Education,Self_Employed,ApplicantIncome,CoapplicantIncome,LoanAmount,Loan_Amount_Term,Credit_History,Property_Area,Loan_Status
0,1.0,1.0,0.0,1,0.0,5720,0.0,110.0,360.0,1.0,2,NaN
1,1.0,1.0,1.0,1,0.0,3076,1500.0,126.0,360.0,1.0,2,NaN
2,1.0,1.0,2.0,1,0.0,5000,1800.0,208.0,360.0,1.0,2,NaN
3,1.0,1.0,2.0,1,0.0,2340,2546.0,100.0,360.0,NaN,2,NaN
4,1.0,0.0,0.0,0,0.0,3276,0.0,78.0,360.0,1.0,2,NaN

# HANDLING MISSING VALUES

In [62]:
#Credit_History
df.Credit_History.size

1348

In [63]:
df.Credit_History.value_counts()

1.0    1033
0.0     207
Name: Credit_History, dtype: int64

In [64]:
df.Credit_History.fillna(np.random.randint(0,2),inplace=True)

In [65]:
df.isnull().sum()

Gender                35
Married                3
Dependents            35
Education              0
Self_Employed         78
ApplicantIncome        0
CoapplicantIncome      0
LoanAmount            32
Loan_Amount_Term      26
Credit_History         0
Property_Area          0
Loan_Status          734
dtype: int64

In [66]:
#2.Married Column
df.Married.fillna(np.random.randint(0,2),inplace=True)

In [67]:
#3.Filling LoanAmount Column Missing values with Median Value
df.LoanAmount.fillna(df.LoanAmount.median(),inplace=True)

In [68]:
#4.Filling Loan_Amount_Term Column Missing values with Mean Value
df.Loan_Amount_Term.fillna(df.Loan_Amount_Term.mean(),inplace=True)

In [69]:
#5 Filling Missing Values in Gender Column
from random import randint
df.Gender.fillna(np.random.randint(0,2),inplace=True)

In [70]:
#6.Filling Dependents Column with Median Value
df.Dependents.fillna(df.Dependents.median(),inplace=True)

In [71]:
#7.Filling Missing values in Self_Employed column
df.Self_Employed.fillna(np.random.randint(0,2),inplace=True)

In [72]:
#8.Filling Missing values in Loan_Status column
df.Loan_Status.fillna(np.random.randint(0,2),inplace=True)

In [73]:
df.isnull().sum()

Gender               0
Married              0
Dependents           0
Education            0
Self_Employed        0
ApplicantIncome      0
CoapplicantIncome    0
LoanAmount           0
Loan_Amount_Term     0
Credit_History       0
Property_Area        0
Loan_Status          0
dtype: int64

In [74]:
df.head()

,Gender,Married,Dependents,Education,Self_Employed,ApplicantIncome,CoapplicantIncome,LoanAmount,Loan_Amount_Term,Credit_History,Property_Area,Loan_Status
0,1.0,1.0,0.0,1,0.0,5720,0.0,110.0,360.0,1.0,2,1.0
1,1.0,1.0,1.0,1,0.0,3076,1500.0,126.0,360.0,1.0,2,1.0
2,1.0,1.0,2.0,1,0.0,5000,1800.0,208.0,360.0,1.0,2,1.0
3,1.0,1.0,2.0,1,0.0,2340,2546.0,100.0,360.0,1.0,2,1.0
4,1.0,0.0,0.0,0,0.0,3276,0.0,78.0,360.0,1.0,2,1.0

In [75]:
df.iloc[1200:1201]

,Gender,Married,Dependents,Education,Self_Employed,ApplicantIncome,CoapplicantIncome,LoanAmount,Loan_Amount_Term,Credit_History,Property_Area,Loan_Status
1200,1.0,1.0,1.0,1,0.0,3747,2139.0,125.0,360.0,1.0,2,1.0

# SPLITTING THE DATA INTO TRAIN AND TEST SET

In [76]:
df.shape

(1348, 12)

In [77]:
features=df.iloc[:,0:11].values
labels=df.iloc[:,-1].values

In [78]:
features[0]

array([1.00e+00, 1.00e+00, 0.00e+00, 1.00e+00, 0.00e+00, 5.72e+03,
       0.00e+00, 1.10e+02, 3.60e+02, 1.00e+00, 2.00e+00])

In [79]:
labels[0]

1.0

In [80]:
from sklearn.model_selection import train_test_split as TTS
features_train,features_test,labels_train,labels_test=TTS(features,labels,test_size=0.3,random_state=0)

In [81]:
features_train.shape

(943, 11)

In [82]:
features_test.shape

(405, 11)

In [83]:
labels_train.shape

(943,)

In [84]:
labels_test.shape

(405,)

# Using Different types of Machine Learning Model

In [85]:
from sklearn.tree import DecisionTreeClassifier
from sklearn.svm import SVC
from sklearn.neighbors import KNeighborsClassifier
from sklearn.naive_bayes import GaussianNB
from sklearn.discriminant_analysis import LinearDiscriminantAnalysis
from sklearn.linear_model import LogisticRegression
from sklearn.ensemble import RandomForestClassifier

# #Fit the all ML Models

In [86]:
models=[]
models.append(("Logistic Regression",LogisticRegression()))
models.append(("Decision Tree",DecisionTreeClassifier()))
models.append(("Linear Discriminant Analysis",LinearDiscriminantAnalysis()))
models.append(("Randon Forest", RandomForestClassifier()))
models.append(("Support Vector Classifler",SVC()))
models.append(("K- Neirest Neighbour",KNeighborsClassifier()))
models.append(("Naive Bayes",GaussianNB()))

In [87]:
scoring='accuracy'

In [88]:
from sklearn.model_selection import KFold
from sklearn.model_selection import cross_val_score
result=[]
names=[]

In [89]:
#PERCENTAGE OF ALL MODELS
for name,model in models :
    kfold=KFold(n_splits=10,shuffle=True,random_state=0)
    cv_result=cross_val_score(model,features,labels,cv=kfold,scoring=scoring)
    result.append(cv_result)
    names.append(name)
    print(model)
    print("%s %f"%(name,cv_result.mean()))

LogisticRegression()
Logistic Regression 0.856125
DecisionTreeClassifier()
Decision Tree 0.850912
LinearDiscriminantAnalysis()
Linear Discriminant Analysis 0.828673
RandomForestClassifier()
Randon Forest 0.876153
SVC()
Support Vector Classifler 0.857601
KNeighborsClassifier()
K- Neirest Neighbour 0.846462
GaussianNB()
Naive Bayes 0.831669

In [90]:
#CHECKING ACCURACY,CONFUSION MATRIX,CLASSIFICATION REPORT
from sklearn.metrics import accuracy_score
from sklearn.metrics import confusion_matrix
from sklearn.metrics import classification_report

RFC=RandomForestClassifier()
RFC.fit(features_train,labels_train)
pred=RFC.predict(features_test)
                 
print ("Accuracy:",accuracy_score(labels_test,pred))
print(confusion_matrix(labels_test,pred))
print(classification_report(labels_test,pred))

Accuracy: 0.8641975308641975
[[  8  50]
 [  5 342]]
              precision    recall  f1-score   support

         0.0       0.62      0.14      0.23        58
         1.0       0.87      0.99      0.93       347

    accuracy                           0.86       405
   macro avg       0.74      0.56      0.58       405
weighted avg       0.84      0.86      0.83       405

In [91]:
print(pred)

[1. 1. 1. 1. 1. 1. 1. 1. 1. 1. 1. 1. 1. 1. 1. 1. 1. 1. 0. 1. 1. 1. 1. 1.
 1. 1. 1. 1. 1. 0. 1. 1. 1. 1. 1. 1. 1. 1. 1. 1. 1. 1. 1. 1. 1. 1. 1. 1.
 0. 1. 1. 1. 0. 1. 1. 1. 1. 1. 1. 1. 1. 1. 1. 1. 1. 1. 1. 1. 1. 1. 1. 1.
 1. 1. 1. 1. 1. 1. 1. 1. 1. 1. 1. 1. 1. 1. 1. 1. 1. 1. 0. 1. 1. 1. 1. 1.
 1. 1. 1. 1. 1. 0. 1. 1. 1. 1. 1. 1. 1. 1. 1. 1. 1. 1. 1. 1. 1. 1. 1. 1.
 1. 1. 1. 1. 1. 1. 1. 1. 1. 1. 1. 1. 1. 1. 1. 1. 1. 1. 0. 1. 1. 1. 1. 1.
 1. 1. 1. 1. 1. 1. 1. 1. 1. 1. 1. 1. 0. 1. 1. 1. 1. 1. 0. 1. 1. 1. 1. 1.
 0. 1. 1. 1. 1. 1. 1. 1. 1. 1. 1. 1. 1. 1. 1. 1. 1. 1. 1. 1. 1. 1. 1. 1.
 0. 1. 1. 1. 1. 1. 1. 1. 1. 1. 1. 1. 1. 1. 1. 1. 1. 1. 1. 1. 1. 1. 1. 1.
 1. 1. 1. 1. 1. 1. 1. 1. 1. 1. 1. 1. 1. 1. 1. 1. 1. 1. 1. 1. 1. 1. 1. 1.
 1. 1. 1. 1. 1. 1. 1. 1. 1. 1. 1. 1. 1. 1. 1. 1. 1. 1. 1. 1. 1. 1. 1. 1.
 1. 1. 1. 1. 1. 1. 1. 1. 1. 1. 1. 1. 1. 1. 1. 1. 1. 1. 1. 1. 1. 1. 1. 1.
 1. 1. 1. 1. 1. 1. 1. 1. 1. 1. 1. 1. 1. 1. 1. 1. 1. 1. 1. 1. 1. 1. 1. 1.
 1. 1. 1. 1. 1. 1. 1. 1. 1. 1. 1. 1. 1. 1. 1. 1. 1. 0. 1. 1. 1. 1. 1. 1.
 1. 1. 1. 1. 1. 1. 1. 1. 1. 1. 1. 1. 1. 1. 1. 1. 1. 1. 1. 1. 1. 1. 1. 1.
 1. 1. 1. 1. 1. 1. 1. 1. 1. 1. 1. 1. 1. 1. 1. 1. 1. 1. 1. 1. 1. 1. 1. 1.
 1. 1. 1. 1. 1. 1. 1. 1. 1. 1. 1. 1. 1. 1. 1. 1. 1. 1. 0. 1. 1.]

In [92]:
prediction=RFC.predict(features_test)

In [93]:
print(prediction)

[1. 1. 1. 1. 1. 1. 1. 1. 1. 1. 1. 1. 1. 1. 1. 1. 1. 1. 0. 1. 1. 1. 1. 1.
 1. 1. 1. 1. 1. 0. 1. 1. 1. 1. 1. 1. 1. 1. 1. 1. 1. 1. 1. 1. 1. 1. 1. 1.
 0. 1. 1. 1. 0. 1. 1. 1. 1. 1. 1. 1. 1. 1. 1. 1. 1. 1. 1. 1. 1. 1. 1. 1.
 1. 1. 1. 1. 1. 1. 1. 1. 1. 1. 1. 1. 1. 1. 1. 1. 1. 1. 0. 1. 1. 1. 1. 1.
 1. 1. 1. 1. 1. 0. 1. 1. 1. 1. 1. 1. 1. 1. 1. 1. 1. 1. 1. 1. 1. 1. 1. 1.
 1. 1. 1. 1. 1. 1. 1. 1. 1. 1. 1. 1. 1. 1. 1. 1. 1. 1. 0. 1. 1. 1. 1. 1.
 1. 1. 1. 1. 1. 1. 1. 1. 1. 1. 1. 1. 0. 1. 1. 1. 1. 1. 0. 1. 1. 1. 1. 1.
 0. 1. 1. 1. 1. 1. 1. 1. 1. 1. 1. 1. 1. 1. 1. 1. 1. 1. 1. 1. 1. 1. 1. 1.
 0. 1. 1. 1. 1. 1. 1. 1. 1. 1. 1. 1. 1. 1. 1. 1. 1. 1. 1. 1. 1. 1. 1. 1.
 1. 1. 1. 1. 1. 1. 1. 1. 1. 1. 1. 1. 1. 1. 1. 1. 1. 1. 1. 1. 1. 1. 1. 1.
 1. 1. 1. 1. 1. 1. 1. 1. 1. 1. 1. 1. 1. 1. 1. 1. 1. 1. 1. 1. 1. 1. 1. 1.
 1. 1. 1. 1. 1. 1. 1. 1. 1. 1. 1. 1. 1. 1. 1. 1. 1. 1. 1. 1. 1. 1. 1. 1.
 1. 1. 1. 1. 1. 1. 1. 1. 1. 1. 1. 1. 1. 1. 1. 1. 1. 1. 1. 1. 1. 1. 1. 1.
 1. 1. 1. 1. 1. 1. 1. 1. 1. 1. 1. 1. 1. 1. 1. 1. 1. 0. 1. 1. 1. 1. 1. 1.
 1. 1. 1. 1. 1. 1. 1. 1. 1. 1. 1. 1. 1. 1. 1. 1. 1. 1. 1. 1. 1. 1. 1. 1.
 1. 1. 1. 1. 1. 1. 1. 1. 1. 1. 1. 1. 1. 1. 1. 1. 1. 1. 1. 1. 1. 1. 1. 1.
 1. 1. 1. 1. 1. 1. 1. 1. 1. 1. 1. 1. 1. 1. 1. 1. 1. 1. 0. 1. 1.]

In [94]:
#LOAN WILL NOT BE PROVIDED CONDITION VALUES
df[df.Loan_Status==0][:1]

,Gender,Married,Dependents,Education,Self_Employed,ApplicantIncome,CoapplicantIncome,LoanAmount,Loan_Amount_Term,Credit_History,Property_Area,Loan_Status
368,1.0,1.0,1.0,1,0.0,4583,1508.0,128.0,360.0,1.0,0,0.0

In [95]:
result=RFC.predict([[1.0, 1.0, 1.0, 1.0, 0.0, 4583, 1508, 128, 360, 1.0, 0.0]])

In [96]:
print(result)

[0.]

In [97]:
#LOAN APPROVING CONDITION VALUES
df.iloc[1209:1210]

,Gender,Married,Dependents,Education,Self_Employed,ApplicantIncome,CoapplicantIncome,LoanAmount,Loan_Amount_Term,Credit_History,Property_Area,Loan_Status
1209,1.0,0.0,0.0,1,0.0,2412,2755.0,130.0,360.0,1.0,0,1.0

In [98]:
result=RFC.predict([[0.0, 0.0, 0.0, 1, 0.0, 1811, 1666.0, 54.0, 360.0, 1.0, 2]])

In [99]:
print(result)
if result==1:
    print('Loan Will be Approved')
else:
    print('Loan will Not be provided')

[1.]
Loan Will be Approved

# CREATED A DATAFRAME TO ENTER VALUES

In [100]:
#Checking using a Random Values
import pandas as pd
df=pd.DataFrame({
'Gender':1,
'Married':1,
'Dependents':2,
'Education':0,
'Self_Employed':0,
'ApplicantIncome':2889,
'CoapplicantIncome':0.0,
'LoanAmount':45,
'Loan_Amount_Term':180,
'Credit_History':0,
'Property_Area':1}
,index=[0])

In [101]:
df

,Gender,Married,Dependents,Education,Self_Employed,ApplicantIncome,CoapplicantIncome,LoanAmount,Loan_Amount_Term,Credit_History,Property_Area
0,1,1,2,0,0,2889,0.0,45,180,0,1

In [102]:
result=RFC.predict(df)
print(result)
if result==1:
    print('Loan Will be Approved')
else:
    print('Loan will Not be provided')

[0.]
Loan will Not be provided

In [103]:
#CREATING A PICKLE FILE TO SAVE THE CLASSIFICATION MODEL
import pickle
#save it to a file
file='/home/expert/Jupyter Notebook/Loan_approval_Predictor/Model.pkl'
with open(file, 'wb') as f:  
          pickle.dump(RFC, f)

"\nimport pickle\n#save it to a file\nfile='/home/expert/Jupyter Notebook/Loan_approval_Predictor/Model.pkl'\nwith open(file, 'wb') as f:  \n          pickle.dump(RFC, f)\n"

In [104]:
with open(file, 'rb') as f: 
    k=pickle.load(f)

"\nwith open(file, 'rb') as f: \n    k=pickle.load(f)\n"

In [105]:
#PREDICTING THE NEW PARAMETERS 
cy=k.predict([[1,1,2,0,0,2889,0.0,45,180,0,1]])
print(cy)

'\ncy=k.predict([[1,1,2,0,0,2889,0.0,45,180,0,1]])\nprint(cy)\n'